ananthb/scurry/firmware/dongle/sdkconfig.defaults.esp32c3
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BT_ENABLED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# scurry spike: hold concurrent bonded HID links to several targets at once.
# This is the claim the whole architecture rests on.
CONFIG_BT_ACL_CONNECTIONS=4
CONFIG_BT_GATTS_MAX_NUM_HANDLE_PRF_APP=16

# Persist bonds so targets pair once, not on every boot.
CONFIG_BT_BLE_SMP_ENABLE=y

# This board exposes only USB Serial/JTAG -- there is no UART bridge. The
# default console routes to UART0, so every log line was going to pins nothing
# is connected to. Without this the spike is unobservable.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# No TLS anywhere in this firmware, so the bundled CA certificate list is dead
# weight -- and generating it needs a python cryptography module that is broken
# in the pinned toolchain (ImportError: _PyIter_NextItem). Turning it off both
# fixes the build and drops a few KB we were never going to use.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=n

# Firmware updates over the protocol link.
#
# The board has 4MB of flash and was configured for 2MB, so half of it was
# simply invisible -- and two 1.5MB app slots do not fit in the half we were
# admitting to.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Two app slots plus the otadata that says which one to boot. See partitions.csv.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# A freshly booted image is on probation until it says otherwise. Without this
# a bad update over the air is unrecoverable without physically fetching the
# dongle, which is the one situation the wireless link exists to avoid.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
